#include "myLed.h"
#include "main.h"
#include "stm32f1xx_it.h"
#include "usart.h"
/*
*********************************************************************************************************
* 函 数 名: myINDLed1On
* 功能说明: 指示灯1亮
* 形  参:   无
* 返 回 值: 无
*********************************************************************************************************
*/
void myINDLed1On(void)
{
    HAL_GPIO_WritePin(IND_LED1_GPIO_Port, IND_LED1_Pin, GPIO_PIN_SET);
}
/*
*********************************************************************************************************
* 函 数 名: myINDLed1Off
* 功能说明: 指示灯1灭
* 形  参:   无
* 返 回 值: 无
*********************************************************************************************************
*/
void myINDLed1Off(void)
{
    HAL_GPIO_WritePin(IND_LED1_GPIO_Port, IND_LED1_Pin, GPIO_PIN_RESET);
}
/*
*********************************************************************************************************
* 函 数 名: myINDLed2On
* 功能说明: 指示灯2亮
* 形  参:   无
* 返 回 值: 无
*********************************************************************************************************
*/
void myINDLed2On(void)
{
    HAL_GPIO_WritePin(IND_LED2_GPIO_Port, IND_LED2_Pin, GPIO_PIN_SET);
}
/*
*********************************************************************************************************
* 函 数 名: myINDLed2Off
* 功能说明: 指示灯2灭
* 形  参:   无
* 返 回 值: 无
*********************************************************************************************************
*/
void myINDLed2Off(void)
{
    HAL_GPIO_WritePin(IND_LED2_GPIO_Port, IND_LED2_Pin, GPIO_PIN_RESET);
}

/*
*********************************************************************************************************
* 函 数 名: myINDLedTest
* 功能说明: 指示灯测试
* 形  参:   无
* 返 回 值: 无
*********************************************************************************************************
*/
void myINDLedTest(void)
{
    static uint32_t SysCnt = 0;
    static bool ledFlag = false;
    uint8_t temp = 0;
    temp = api_GetSysTickCount500ms();
    if (SysCnt != temp)
    {
        SysCnt = temp;

        if (ledFlag == true)
        {
            myINDLed1On();
            // debug_uart_printf("Led1On......\r\n");
            ledFlag = false;
        }
        else
        {
            myINDLed1Off();
            // debug_uart_printf("Led1Off......\r\n");
            ledFlag = true;
        }
    }
}
